In [16]:
import pandas as pd
data = pd.read_csv("C:/Users/user/OneDrive/Desktop/data practice/python/data frames/Employees.csv")
data1 = pd.read_csv("C:/Users/user/OneDrive/Desktop/data practice/python/data frames/Departments.csv")
print(data)
print()
print(data1)

   EmployeeID FirstName  LastName  DepartmentID  Salary
0           1      John       Doe           101   60000
1           2      Jane     Smith           102   55000
2           3     Emily     Jones           103   75000
3           4   Michael   Johnson           101   65000
4           5     Sarah  Williams           102   58000
5           6     David     Brown           103   72000
6           7     Laura    Garcia           101   69000
7           8     James  Martinez           102   57000
8           9    Olivia    Wilson           103   80000
9          10    Daniel  Anderson           101   62000

   DepartmentID DepartmentName       Location
0           101    Engineering       New York
1           102      Marketing  San Francisco
2           103        Finance        Chicago
3           104             HR    Los Angeles

In [15]:
print(pd.merge(data, data1,on = "DepartmentID"))

   EmployeeID FirstName  LastName  DepartmentID  Salary DepartmentName  \
0           1      John       Doe           101   60000    Engineering
1           2      Jane     Smith           102   55000      Marketing
2           3     Emily     Jones           103   75000        Finance
3           4   Michael   Johnson           101   65000    Engineering
4           5     Sarah  Williams           102   58000      Marketing
5           6     David     Brown           103   72000        Finance
6           7     Laura    Garcia           101   69000    Engineering
7           8     James  Martinez           102   57000      Marketing
8           9    Olivia    Wilson           103   80000        Finance
9          10    Daniel  Anderson           101   62000    Engineering

        Location
0       New York
1  San Francisco
2        Chicago
3       New York
4  San Francisco
5        Chicago
6       New York
7  San Francisco
8        Chicago
9       New York

In [19]:
print(pd.merge(data, data1,on = "DepartmentID", how = "inner"))
print()
print(pd.merge(data, data1,on = "DepartmentID", how = "left"))

   EmployeeID FirstName  LastName  DepartmentID  Salary DepartmentName  \
0           1      John       Doe           101   60000    Engineering
1           2      Jane     Smith           102   55000      Marketing
2           3     Emily     Jones           103   75000        Finance
3           4   Michael   Johnson           101   65000    Engineering
4           5     Sarah  Williams           102   58000      Marketing
5           6     David     Brown           103   72000        Finance
6           7     Laura    Garcia           101   69000    Engineering
7           8     James  Martinez           102   57000      Marketing
8           9    Olivia    Wilson           103   80000        Finance
9          10    Daniel  Anderson           101   62000    Engineering

        Location
0       New York
1  San Francisco
2        Chicago
3       New York
4  San Francisco
5        Chicago
6       New York
7  San Francisco
8        Chicago
9       New York

   EmployeeID FirstName  LastName  DepartmentID  Salary DepartmentName  \
0           1      John       Doe           101   60000    Engineering
1           2      Jane     Smith           102   55000      Marketing
2           3     Emily     Jones           103   75000        Finance
3           4   Michael   Johnson           101   65000    Engineering
4           5     Sarah  Williams           102   58000      Marketing
5           6     David     Brown           103   72000        Finance
6           7     Laura    Garcia           101   69000    Engineering
7           8     James  Martinez           102   57000      Marketing
8           9    Olivia    Wilson           103   80000        Finance
9          10    Daniel  Anderson           101   62000    Engineering

        Location
0       New York
1  San Francisco
2        Chicago
3       New York
4  San Francisco
5        Chicago
6       New York
7  San Francisco
8        Chicago
9       New York

In [20]:
print(pd.merge(right = data, left = data1,on = "DepartmentID", how = "left"))

    DepartmentID DepartmentName       Location  EmployeeID FirstName  \
0            101    Engineering       New York         1.0      John
1            101    Engineering       New York         4.0   Michael
2            101    Engineering       New York         7.0     Laura
3            101    Engineering       New York        10.0    Daniel
4            102      Marketing  San Francisco         2.0      Jane
5            102      Marketing  San Francisco         5.0     Sarah
6            102      Marketing  San Francisco         8.0     James
7            103        Finance        Chicago         3.0     Emily
8            103        Finance        Chicago         6.0     David
9            103        Finance        Chicago         9.0    Olivia
10           104             HR    Los Angeles         NaN       NaN

    LastName   Salary
0        Doe  60000.0
1    Johnson  65000.0
2     Garcia  69000.0
3   Anderson  62000.0
4      Smith  55000.0
5   Williams  58000.0
6   Martinez  57000.0
7      Jones  75000.0
8      Brown  72000.0
9     Wilson  80000.0
10       NaN      NaN

In [21]:
print(pd.merge(right = data, left = data1,on = "DepartmentID", how = "right"))

   DepartmentID DepartmentName       Location  EmployeeID FirstName  LastName  \
0           101    Engineering       New York           1      John       Doe
1           102      Marketing  San Francisco           2      Jane     Smith
2           103        Finance        Chicago           3     Emily     Jones
3           101    Engineering       New York           4   Michael   Johnson
4           102      Marketing  San Francisco           5     Sarah  Williams
5           103        Finance        Chicago           6     David     Brown
6           101    Engineering       New York           7     Laura    Garcia
7           102      Marketing  San Francisco           8     James  Martinez
8           103        Finance        Chicago           9    Olivia    Wilson
9           101    Engineering       New York          10    Daniel  Anderson

   Salary
0   60000
1   55000
2   75000
3   65000
4   58000
5   72000
6   69000
7   57000
8   80000
9   62000

In [24]:
data1 = {"Emp Id":["E01", "E02", "E03", "E04", "E05"],
         "names": ["Ram", "bi", "ajju", "achi", "boobOO"],
         "AGE": [1, 2, 3, 4, 5]}
data2 = {"Emp Id":["E06", "E07", "E08", "E09", "E10"],
         "names": ["Ramd", "bibi", "aju", "ashii", "bOOmer"],
         "AGE": [1, 2, 3, 4, 5]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [25]:
print(pd.concat([df1, df2]))

  Emp Id   names  AGE
0    E01     Ram    1
1    E02      bi    2
2    E03    ajju    3
3    E04    achi    4
4    E05  boobOO    5
0    E06    Ramd    1
1    E07    bibi    2
2    E08     aju    3
3    E09   ashii    4
4    E10  bOOmer    5